{
  "id": "computer-crimes-1997",
  "type": "statute",
  "title": "Akta Jenayah Komputer 1997",
  "title_en": "Computer Crimes Act 1997",
  "short_name": "CCA 1997",
  "status": "in_force",
  "issued_date": "1997-06-01",
  "in_force_date": "2000-06-01",
  "url": "https://www.commonlii.org/my/legis/consol_act/cca1997210/",
  "description": "An Act to provide for offences relating to the misuse of computers. The Act criminalizes unauthorized access to computer material, unauthorized modification of computer contents, wrongful communication of access codes, and related abetments. It applies extraterritorially to any person regardless of nationality if the offence involves a computer located in Malaysia.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "Part I - Preliminary",
      "section": "1",
      "title": "Short title and commencement",
      "content": "1. (1) This Act may be cited as the Computer Crimes Act 1997. (2) This Act shall come into force on such date as the Minister may, by notification in the Gazette, appoint."
    },
    {
      "provision_ref": "s2",
      "chapter": "Part I - Preliminary",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — 'computer' means an electronic, magnetic, optical, electrochemical, or other data processing device, or a group of such interconnected or related devices, performing logical, arithmetic, storage and display functions, and includes any data storage facility or communications facility directly related to or operating in conjunction with such device or group of such interconnected or related devices, but does not include an automated typewriter or typesetter, or a portable hand held calculator or other similar device which is non-programmable or which does not contain any data storage facility; 'computer network' means the interconnection of communication lines and circuits with a computer through remote terminals or a complex consisting of two or more interconnected computers; 'computer output' or 'output' means a statement or representation, whether in written, printed, pictorial, film, graphical, acoustic or other form — (a) produced by a computer; or (b) accurately translated from a statement or representation so produced; 'data' means representations of information or of concepts that are being prepared or have been prepared in a form suitable for use in a computer; 'function' includes logic, control, arithmetic, deletion, storage, retrieval and communication or telecommunication to, from or within a computer; 'program' means data representing instructions or statements that, when executed in a computer, causes the computer to perform a function."
    },
    {
      "provision_ref": "s3",
      "chapter": "Part II - Offences",
      "section": "3",
      "title": "Unauthorised access to computer material",
      "content": "3. (1) A person shall be guilty of an offence if — (a) he causes a computer to perform any function with intent to secure access to any program or data held in any computer; (b) the access he intends to secure is unauthorised; and (c) he knows at the time when he causes the computer to perform the function that that is the case. (2) The intent a person has to have for the purposes of this section need not be directed at — (a) any particular program or data; (b) a program or data of any particular kind; or (c) a program or data held in any particular computer. (3) A person guilty of an offence under this section shall on conviction be liable to a fine not exceeding fifty thousand ringgit or to imprisonment for a term not exceeding five years or to both."
    },
    {
      "provision_ref": "s4",
      "chapter": "Part II - Offences",
      "section": "4",
      "title": "Unauthorised access with intent to commit or facilitate commission of further offence",
      "content": "4. (1) A person shall be guilty of an offence under this section if he commits an offence referred to in section 3 with intent — (a) to commit an offence involving fraud or dishonesty or which causes injury as defined in the Penal Code; or (b) to facilitate the commission of such an offence whether by himself or by any other person. (2) For the purposes of this section, it is immaterial whether the further offence is to be committed at the time of the unauthorised access or on any future occasion. (3) A person guilty of an offence under this section shall on conviction be liable to a fine not exceeding one hundred and fifty thousand ringgit or to imprisonment for a term not exceeding ten years or to both."
    },
    {
      "provision_ref": "s5",
      "chapter": "Part II - Offences",
      "section": "5",
      "title": "Unauthorised modification of the contents of any computer",
      "content": "5. (1) A person shall be guilty of an offence if he does any act which he knows will cause unauthorised modification of the contents of any computer. (2) For the purposes of this section, it is immaterial that the act in question is not directed at — (a) any particular program or data; (b) a program or data of any particular kind; or (c) a program or data held in any particular computer. (3) For the purposes of this section, it is immaterial whether an unauthorised modification is, or is intended to be, permanent or merely temporary. (4) For the purposes of this section — (a) a modification of the contents of any computer takes place if, by the operation of any function of the computer concerned or any other computer — (i) any program or data held in the computer concerned is altered or erased; (ii) any program or data is added to its contents; or (iii) any act occurs which impairs the normal operation of any computer; and (b) any act which contributes towards causing a modification of the kind mentioned in paragraph (a) shall be regarded as causing it. (5) A person guilty of an offence under this section shall on conviction be liable to a fine not exceeding one hundred thousand ringgit or to imprisonment for a term not exceeding seven years or to both."
    },
    {
      "provision_ref": "s6",
      "chapter": "Part II - Offences",
      "section": "6",
      "title": "Wrongful communication",
      "content": "6. (1) A person shall be guilty of an offence if he communicates directly or indirectly a number, code, password or other means of access to a computer to any person other than a person to whom he is duly authorised to communicate. (2) A person guilty of an offence under this section shall on conviction be liable to a fine not exceeding twenty-five thousand ringgit or to imprisonment for a term not exceeding three years or to both."
    },
    {
      "provision_ref": "s7",
      "chapter": "Part II - Offences",
      "section": "7",
      "title": "Abetments and attempts punishable as offences",
      "content": "7. (1) A person who abets the commission of or who attempts to commit any offence under this Act shall be guilty of that offence and shall on conviction be liable to the punishment provided for the offence. (2) A person may be charged with an offence under subsection (1) and may be tried, convicted and punished for such offence notwithstanding that the person who committed the offence has not been charged, tried, convicted or punished."
    },
    {
      "provision_ref": "s8",
      "chapter": "Part III - Ancillary and General Provisions",
      "section": "8",
      "title": "Presumption",
      "content": "8. (1) Where a person is charged with an offence under section 3, he shall be presumed to have obtained access to any program or data held in a computer if he is in possession or control of any program, data, or other information which — (a) is held in any computer or retrieved from any computer; (b) he is not authorised to possess or have control of; and (c) he could not have obtained without having access to any program or data held in the computer. (2) Where a person is charged with an offence under section 5, he shall be presumed to have done any act which caused the unauthorised modification if he is shown to have been in possession or control of any program, data, or other information which — (a) was used for the purpose of causing the modification; or (b) which resulted from the modification."
    },
    {
      "provision_ref": "s9",
      "chapter": "Part III - Ancillary and General Provisions",
      "section": "9",
      "title": "Territorial scope of offences under this Act",
      "content": "9. (1) The provisions of this Act shall, in relation to any person, whatever his nationality or citizenship, have effect outside as well as within Malaysia, and where an offence under this Act is committed by any person in any place outside Malaysia, he may be dealt with in respect of such offence as if it was committed at any place within Malaysia. (2) For the purposes of subsection (1), this Act shall apply if, for the offence in question, the computer, program or data was in Malaysia or capable of being connected to or sent to or used by or with a computer in Malaysia at the material time. (3) Any offence under this Act committed by any person in any place outside Malaysia may, for the purpose of ensuring his return to Malaysia, be treated as having been committed at any place within Malaysia."
    },
    {
      "provision_ref": "s10",
      "chapter": "Part III - Ancillary and General Provisions",
      "section": "10",
      "title": "Powers of search",
      "content": "10. (1) Notwithstanding any other written law, a police officer not below the rank of Inspector, on obtaining information that any offence under this Act is being or has been committed, may — (a) enter any premises and there search for, seize and detain any computer, output, data and other materials; (b) search any person who is in or on the premises; (c) break open, examine and search any thing, including any computer, in or on the premises; and (d) stop, search and seize any conveyance. (2) A police officer making a search under subsection (1) may, by order in writing, require — (a) any person who is in possession or has control of the computer, data, program, or other material to produce or provide access to the computer, data, program, or other material; (b) any person in possession of decryption information to grant him access to the decrypted data in intelligible form."
    },
    {
      "provision_ref": "s11",
      "chapter": "Part III - Ancillary and General Provisions",
      "section": "11",
      "title": "Obstruction of search",
      "content": "11. Any person who — (a) assaults, obstructs, hinders or delays any police officer in effecting any entrance which he is entitled to effect under this Act, or in the execution of any duty imposed or power conferred by this Act; (b) fails to comply with any lawful demand of any police officer in the execution of his duty under this Act; or (c) refuses to permit a police officer access to the premises or to the computer or refuses to produce any computer, document, data, program, or other material in the execution of his duty under this Act, shall be guilty of an offence and shall on conviction be liable to a fine not exceeding twenty-five thousand ringgit or to imprisonment for a term not exceeding three years or to both."
    },
    {
      "provision_ref": "s12",
      "chapter": "Part III - Ancillary and General Provisions",
      "section": "12",
      "title": "Prosecution",
      "content": "12. No prosecution for any offence under this Act shall be instituted except by or with the consent of the Public Prosecutor."
    }
  ],
  "definitions": [
    {
      "term": "computer",
      "definition": "An electronic, magnetic, optical, electrochemical, or other data processing device, or a group of such interconnected or related devices, performing logical, arithmetic, storage and display functions, and includes any data storage facility or communications facility directly related to or operating in conjunction with such device.",
      "source_provision": "s2"
    },
    {
      "term": "computer network",
      "definition": "The interconnection of communication lines and circuits with a computer through remote terminals or a complex consisting of two or more interconnected computers.",
      "source_provision": "s2"
    },
    {
      "term": "data",
      "definition": "Representations of information or of concepts that are being prepared or have been prepared in a form suitable for use in a computer.",
      "source_provision": "s2"
    },
    {
      "term": "function",
      "definition": "Includes logic, control, arithmetic, deletion, storage, retrieval and communication or telecommunication to, from or within a computer.",
      "source_provision": "s2"
    },
    {
      "term": "program",
      "definition": "Data representing instructions or statements that, when executed in a computer, causes the computer to perform a function.",
      "source_provision": "s2"
    },
    {
      "term": "unauthorised access",
      "definition": "Access of any kind by any person to any program or data held in a computer where he is not entitled to control access of the kind in question to the program or data, and he does not have consent to access by him of the kind in question from any person who is so entitled.",
      "source_provision": "s2"
    }
  ]
}
