{
  "id": "companies-2016",
  "type": "statute",
  "title": "Akta Syarikat 2016",
  "title_en": "Companies Act 2016",
  "short_name": "CA 2016",
  "status": "in_force",
  "issued_date": "2016-09-15",
  "in_force_date": "2017-01-31",
  "url": "https://www.commonlii.org/my/legis/consol_act/ca2016139/",
  "description": "An Act to provide for the incorporation, registration, management, and winding up of companies, the duties and responsibilities of officers, the registration and regulation of foreign companies, and other related matters. Replaces the Companies Act 1965.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "Part I - Preliminary",
      "section": "1",
      "title": "Short title and commencement",
      "content": "1. (1) This Act may be cited as the Companies Act 2016. (2) This Act comes into operation on a date to be appointed by the Minister by notification in the Gazette."
    },
    {
      "provision_ref": "s2",
      "chapter": "Part I - Preliminary",
      "section": "2",
      "title": "Interpretation",
      "content": "2. (1) In this Act, unless the context otherwise requires — 'company' means a company incorporated under this Act or under any corresponding previous written law; 'constitution' means the constitution of a company adopted under this Act; 'corporation' means any body corporate formed or incorporated or existing within Malaysia or outside Malaysia and includes any foreign company; 'director' includes any person occupying the position of director of a corporation by whatever name called and includes a person in accordance with whose directions or instructions the directors of a corporation are accustomed to act and an alternate or substitute director; 'officer' in relation to a corporation, includes — (a) any director, secretary or employee of the corporation; (b) a receiver and manager of any part of the undertaking of the corporation appointed under a power contained in any instrument; and (c) any liquidator of a company appointed in a voluntary winding up; 'Registrar' means the Registrar of Companies appointed under section 20A of the Registration of Businesses Act 1956; 'related corporation' in relation to a corporation, means a corporation that is the corporation's holding company, subsidiary, or a subsidiary of the corporation's holding company; 'share' means a share in the share capital of a corporation."
    },
    {
      "provision_ref": "s3",
      "chapter": "Part I - Preliminary",
      "section": "3",
      "title": "Application",
      "content": "3. (1) This Act shall apply to — (a) all companies incorporated under this Act; (b) all foreign companies registered under this Act; and (c) all other companies incorporated under any corresponding previous written law and which are deemed to be incorporated under this Act."
    },
    {
      "provision_ref": "s4",
      "chapter": "Part I - Preliminary",
      "section": "4",
      "title": "Registrar and Deputy Registrars",
      "content": "4. The Registrar of Companies and Deputy Registrars of Companies appointed under the Registration of Businesses Act 1956 shall be the Registrar and Deputy Registrars for the purposes of this Act."
    },
    {
      "provision_ref": "s7",
      "chapter": "Part II - Incorporation of Companies",
      "section": "7",
      "title": "Types of companies",
      "content": "7. (1) A company may be — (a) a company limited by shares; (b) a company limited by guarantee; or (c) an unlimited company. (2) A company may be incorporated as a private company or a public company."
    },
    {
      "provision_ref": "s9",
      "chapter": "Part II - Incorporation of Companies",
      "section": "9",
      "title": "Restriction on formation",
      "content": "9. (1) A company shall not be formed for any unlawful purpose. (2) The Registrar shall not register a company if he is satisfied that the company is being formed for any unlawful purpose."
    },
    {
      "provision_ref": "s10",
      "chapter": "Part II - Incorporation of Companies",
      "section": "10",
      "title": "Minimum number of members",
      "content": "10. (1) A company may be incorporated by one or more persons by subscribing their name to a constitution and by complying with the requirements as to registration under this Act. (2) Each subscriber shall take at least one share."
    },
    {
      "provision_ref": "s14",
      "chapter": "Part II - Incorporation of Companies",
      "section": "14",
      "title": "Application for incorporation",
      "content": "14. (1) An application for the incorporation of a company shall be lodged with the Registrar. (2) The application shall be accompanied by — (a) the constitution, if any; (b) a statutory declaration by each director and promoter that he is not a disqualified person; (c) the consent of each director to act as director; and (d) such fee as may be prescribed."
    },
    {
      "provision_ref": "s16",
      "chapter": "Part II - Incorporation of Companies",
      "section": "16",
      "title": "Effect of incorporation",
      "content": "16. (1) Upon incorporation, the company shall be a body corporate by the name stated in the certificate of incorporation, with perpetual succession and a common seal, and shall have the power to sue and be sued, to acquire, hold and dispose of property, and to do all matters and things incidental or appertaining to a body corporate."
    },
    {
      "provision_ref": "s195",
      "chapter": "Part III - Management of Company",
      "section": "195",
      "title": "Directors",
      "content": "195. (1) Every company shall have at least one director who ordinarily resides in Malaysia by having a principal place of residence in Malaysia. (2) A private company shall have a minimum of one director. (3) A public company shall have a minimum of two directors."
    },
    {
      "provision_ref": "s196",
      "chapter": "Part III - Management of Company",
      "section": "196",
      "title": "Qualifications of directors",
      "content": "196. (1) A natural person of full age and capacity may be appointed as a director of a company. (2) No person shall be appointed or shall act as a director of a company if he — (a) is an undischarged bankrupt; (b) has been convicted of an offence relating to the promotion, formation or management of a corporation; (c) has been convicted of an offence involving bribery, fraud or dishonesty; or (d) has been convicted of an offence under this Act unless five years have elapsed since the date of his conviction or his release from prison."
    },
    {
      "provision_ref": "s197",
      "chapter": "Part III - Management of Company",
      "section": "197",
      "title": "Appointment of directors",
      "content": "197. (1) The first directors of a company shall be those named in the application for incorporation or in the constitution. (2) Subsequent directors of a company shall be appointed in accordance with the constitution or by ordinary resolution."
    },
    {
      "provision_ref": "s198",
      "chapter": "Part III - Management of Company",
      "section": "198",
      "title": "Consent to act as director",
      "content": "198. (1) A person shall not be appointed as a director unless he has consented in writing to act as a director. (2) The company shall lodge with the Registrar the consent of the director within fourteen days of the appointment."
    },
    {
      "provision_ref": "s201",
      "chapter": "Part III - Management of Company",
      "section": "201",
      "title": "Removal of directors",
      "content": "201. (1) The members of a company may by ordinary resolution remove a director before the expiration of the director's period of office. (2) A director who is removed under this section may make written representations to the company and request that such representations be notified to the members."
    },
    {
      "provision_ref": "s210",
      "chapter": "Part III - Management of Company",
      "section": "210",
      "title": "Register of directors",
      "content": "210. (1) Every company shall maintain a register of its directors. (2) The register shall contain the following particulars in respect of each director — (a) name, including any former name; (b) identification number or passport number; (c) nationality; (d) the usual residential address; (e) the business occupation, if any; (f) the date of appointment; and (g) any other directorship of public companies."
    },
    {
      "provision_ref": "s211",
      "chapter": "Part III - Management of Company",
      "section": "211",
      "title": "Notification of changes",
      "content": "211. (1) A company shall lodge with the Registrar a return in the prescribed form within thirty days after any change among its directors or in any of the particulars contained in the register of directors."
    },
    {
      "provision_ref": "s213",
      "chapter": "Part III - Management of Company",
      "section": "213",
      "title": "Duty to act in good faith",
      "content": "213. (1) A director of a company shall at all times exercise his powers for a proper purpose and in good faith in the best interest of the company. (2) The duty imposed by this section on a director of a company includes a duty of the director to have regard to the interests of the employees of the company generally, in so far as they are relevant to the decision being made."
    },
    {
      "provision_ref": "s214",
      "chapter": "Part III - Management of Company",
      "section": "214",
      "title": "Duty to exercise reasonable care, skill and diligence",
      "content": "214. (1) A director of a company shall exercise reasonable care, skill and diligence with — (a) the knowledge, skill and experience which may reasonably be expected of a director having the same responsibilities; and (b) any additional knowledge, skill and experience which the director in fact has."
    },
    {
      "provision_ref": "s215",
      "chapter": "Part III - Management of Company",
      "section": "215",
      "title": "Duty to exercise powers for proper purpose",
      "content": "215. A director of a company shall exercise his powers in accordance with this Act, for a proper purpose and in good faith in the best interest of the company. The duty under this section is not displaced by the fact that the company has approved or may approve the matter."
    },
    {
      "provision_ref": "s216",
      "chapter": "Part III - Management of Company",
      "section": "216",
      "title": "Duty to avoid conflict of interest",
      "content": "216. (1) A director of a company shall not, without the prior approval of the board, place himself in a position where his personal interest conflicts or may conflict with the interests of the company. (2) A director who has a direct or indirect interest in a transaction or arrangement with the company shall disclose the nature and extent of the interest to the board."
    },
    {
      "provision_ref": "s217",
      "chapter": "Part III - Management of Company",
      "section": "217",
      "title": "Duty not to accept benefits from third parties",
      "content": "217. (1) A director of a company shall not accept any benefit from a third party conferred by reason of — (a) his being a director; or (b) his doing or not doing anything as a director."
    },
    {
      "provision_ref": "s218",
      "chapter": "Part III - Management of Company",
      "section": "218",
      "title": "Duty to disclose interest in contract",
      "content": "218. (1) Every director of a company who is in any way, whether directly or indirectly, interested in a contract or proposed contract with the company shall as soon as practicable after the relevant facts have come to his knowledge, declare the nature of his interest at a meeting of the directors of the company. (2) A director who fails to comply with this section commits an offence and shall, on conviction, be liable to imprisonment for a term not exceeding five years or to a fine not exceeding three million ringgit or to both."
    },
    {
      "provision_ref": "s235",
      "chapter": "Part III - Management of Company",
      "section": "235",
      "title": "Register of members",
      "content": "235. (1) Every company shall maintain a register of its members. (2) The register shall contain — (a) the names and addresses of the members; (b) the date on which each person was entered in the register as a member; (c) the date on which any person ceased to be a member; and (d) the number and class of shares held by each member."
    },
    {
      "provision_ref": "s236",
      "chapter": "Part III - Management of Company",
      "section": "236",
      "title": "Index of members",
      "content": "236. (1) Every company having more than fifty members shall maintain an index of its members, unless the register of members is in such form as to constitute in itself an index."
    },
    {
      "provision_ref": "s237",
      "chapter": "Part III - Management of Company",
      "section": "237",
      "title": "Place of register",
      "content": "237. (1) The register of members and index shall be kept at the registered office of the company or at such other place in Malaysia as the directors think fit."
    },
    {
      "provision_ref": "s240",
      "chapter": "Part III - Management of Company",
      "section": "240",
      "title": "Register of debenture holders",
      "content": "240. (1) Every company which issues debentures shall maintain a register of debenture holders containing — (a) the names and addresses of the debenture holders; (b) the amount of debentures held by each holder; and (c) the date on which the name of each person was entered in the register."
    },
    {
      "provision_ref": "s242",
      "chapter": "Part III - Management of Company",
      "section": "242",
      "title": "Register of charges",
      "content": "242. (1) Every company shall keep a copy of every instrument creating a charge requiring registration and a register of all charges specifically affecting property of the company. (2) The register shall give a short description of the property charged, the amount of the charge and the name of the person entitled thereto."
    },
    {
      "provision_ref": "s245",
      "chapter": "Part III - Management of Company",
      "section": "245",
      "title": "Financial statements and reports",
      "content": "245. (1) The directors of a company shall cause to be prepared financial statements of the company for each financial year. (2) The financial statements required to be prepared shall include — (a) a statement of financial position as at the end of the financial year; (b) a statement of comprehensive income for the financial year; (c) a statement of changes in equity for the financial year; (d) a statement of cash flows for the financial year; and (e) notes to the financial statements. (3) The financial statements shall be prepared in accordance with the applicable approved accounting standards."
    },
    {
      "provision_ref": "s246",
      "chapter": "Part III - Management of Company",
      "section": "246",
      "title": "Directors' report",
      "content": "246. (1) The directors of a company shall prepare a directors' report in respect of each financial year. (2) The directors' report shall contain — (a) the names of the directors of the company during the financial year; (b) the principal activities of the company; (c) the amount of dividends paid or declared; (d) any matter material for the appreciation of the state of the company's affairs; and (e) any other matters required by the applicable approved accounting standards."
    },
    {
      "provision_ref": "s248",
      "chapter": "Part III - Management of Company",
      "section": "248",
      "title": "Audited financial statements",
      "content": "248. (1) The financial statements of every company shall be audited. (2) The Registrar may exempt any company from the requirement under subsection (1) subject to such terms and conditions as the Registrar thinks fit."
    },
    {
      "provision_ref": "s539",
      "chapter": "Part V - Miscellaneous",
      "section": "539",
      "title": "Records in electronic form",
      "content": "539. (1) Where any provision of this Act requires the keeping of any record, register or minute, the record, register or minute may be kept in electronic form so long as it is kept in accordance with the requirements of the Electronic Commerce Act 2006. (2) The information or matter recorded shall be accessible so as to be usable for subsequent reference."
    },
    {
      "provision_ref": "s540",
      "chapter": "Part V - Miscellaneous",
      "section": "540",
      "title": "Service of documents",
      "content": "540. (1) A document may be served on a company by — (a) leaving it at the registered office of the company; (b) sending it by post to the registered office of the company; or (c) any electronic means of communication as approved by the Registrar."
    },
    {
      "provision_ref": "s541",
      "chapter": "Part V - Miscellaneous",
      "section": "541",
      "title": "Electronic filing",
      "content": "541. (1) The Registrar may require or permit any document required to be lodged under this Act to be lodged by electronic means. (2) A document lodged electronically shall be deemed to have been lodged if it is in a form approved by the Registrar."
    },
    {
      "provision_ref": "s543",
      "chapter": "Part V - Miscellaneous",
      "section": "543",
      "title": "Retention of records",
      "content": "543. (1) A company shall retain all accounting records, registers, minutes, and other documents required to be kept under this Act for a period of not less than seven years from the completion of the transactions to which they relate. (2) A person who contravenes subsection (1) commits an offence."
    },
    {
      "provision_ref": "s550",
      "chapter": "Part V - Miscellaneous",
      "section": "550",
      "title": "False or misleading statements",
      "content": "550. (1) A person who, in any return, report, certificate, financial statement or other document required by or for the purposes of this Act, makes or authorises the making of a statement which is false or misleading in a material particular, knowing it to be false or misleading, commits an offence. (2) A person who commits an offence under this section shall, on conviction, be liable to imprisonment for a term not exceeding ten years or to a fine not exceeding three million ringgit or to both."
    },
    {
      "provision_ref": "s551",
      "chapter": "Part V - Miscellaneous",
      "section": "551",
      "title": "Destruction, concealment, mutilation of records",
      "content": "551. (1) A person who, with intent to defraud — (a) destroys, conceals, mutilates, or falsifies any book, paper, or security of a company; or (b) makes or is privy to the making of any false or fraudulent entry in any register, book or document of the company, commits an offence and shall, on conviction, be liable to imprisonment for a term not exceeding five years or to a fine not exceeding three million ringgit or to both."
    },
    {
      "provision_ref": "s553",
      "chapter": "Part V - Miscellaneous",
      "section": "553",
      "title": "Duty to report suspected offences",
      "content": "553. Where an auditor in the course of the performance of his duties as auditor of a company becomes aware of any matter which in his opinion constitutes evidence of a breach of any provision of this Act or constitutes a serious offence involving fraud or dishonesty, the auditor shall forthwith report the matter to the Registrar."
    },
    {
      "provision_ref": "s560",
      "chapter": "Part V - Miscellaneous",
      "section": "560",
      "title": "General penalty",
      "content": "560. A person who commits an offence under this Act for which no penalty is expressly provided shall, on conviction, be liable to a fine not exceeding fifty thousand ringgit and, in the case of a continuing offence, to a further fine not exceeding one thousand ringgit for each day during which the offence continues after conviction."
    },
    {
      "provision_ref": "s554",
      "chapter": "Part V - Miscellaneous",
      "section": "554",
      "title": "Protection of informers",
      "content": "554. (1) No witness shall be obliged or permitted to disclose the name or address of any informer, or the substance of the information received from him, or to state any matter which might lead to his discovery. (2) If any book, document or paper which is in evidence or liable to inspection in any civil or criminal proceeding contains any entry in which any informer is named or described or which might lead to his discovery, the court shall cause all such passages to be concealed from view or to be obliterated so far as may be necessary to protect the informer from discovery."
    },
    {
      "provision_ref": "s555",
      "chapter": "Part V - Miscellaneous",
      "section": "555",
      "title": "Provision for professional persons",
      "content": "555. (1) No person who acts as an auditor, liquidator, receiver, receiver and manager or any other person who carries out any duty or function under this Act shall be liable to be sued for any act done or statement made in good faith in the performance of his duties."
    },
    {
      "provision_ref": "s556",
      "chapter": "Part V - Miscellaneous",
      "section": "556",
      "title": "Power to compound offences",
      "content": "556. (1) The Registrar may, with the written consent of the Public Prosecutor, compound any offence committed by any person under this Act by accepting from such person a sum of money not exceeding fifty per centum of the maximum fine for that offence."
    },
    {
      "provision_ref": "s557",
      "chapter": "Part V - Miscellaneous",
      "section": "557",
      "title": "Jurisdiction of court",
      "content": "557. Notwithstanding any other written law, the Sessions Court shall have jurisdiction to try any offence under this Act and to award any punishment provided for under this Act."
    },
    {
      "provision_ref": "s558",
      "chapter": "Part V - Miscellaneous",
      "section": "558",
      "title": "Recovery of fees and charges",
      "content": "558. Any fees, charges, or other money due to the Registrar under this Act may be recovered as a debt due to the Government."
    },
    {
      "provision_ref": "s559",
      "chapter": "Part V - Miscellaneous",
      "section": "559",
      "title": "Translation of documents",
      "content": "559. Where any document lodged with the Registrar is not in the national language or the English language, the document shall be accompanied by a certified translation of the document in the national language or English language."
    },
    {
      "provision_ref": "s563",
      "chapter": "Part V - Miscellaneous",
      "section": "563",
      "title": "Power to make regulations",
      "content": "563. (1) The Minister may make regulations as are necessary or expedient for carrying into effect the provisions of this Act. (2) Without prejudice to the generality of subsection (1), the Minister may make regulations for — (a) prescribing forms required for the purposes of this Act; (b) prescribing fees to be paid under this Act; (c) prescribing anything required or permitted to be prescribed under this Act."
    }
  ],
  "definitions": [
    {
      "term": "company",
      "definition": "A company incorporated under this Act or under any corresponding previous written law.",
      "source_provision": "s2"
    },
    {
      "term": "director",
      "definition": "Any person occupying the position of director of a corporation by whatever name called and includes a person in accordance with whose directions or instructions the directors of a corporation are accustomed to act and an alternate or substitute director.",
      "source_provision": "s2"
    },
    {
      "term": "officer",
      "definition": "In relation to a corporation, includes any director, secretary or employee of the corporation, a receiver and manager appointed under an instrument, and any liquidator appointed in a voluntary winding up.",
      "source_provision": "s2"
    },
    {
      "term": "corporation",
      "definition": "Any body corporate formed or incorporated or existing within Malaysia or outside Malaysia and includes any foreign company.",
      "source_provision": "s2"
    },
    {
      "term": "related corporation",
      "definition": "In relation to a corporation, means a corporation that is the corporation's holding company, subsidiary, or a subsidiary of the corporation's holding company.",
      "source_provision": "s2"
    },
    {
      "term": "constitution",
      "definition": "The constitution of a company adopted under this Act.",
      "source_provision": "s2"
    }
  ]
}
