{
  "id": "evidence-act-1950",
  "type": "statute",
  "title": "Akta Keterangan 1950",
  "title_en": "Evidence Act 1950",
  "short_name": "EA 1950",
  "status": "in_force",
  "issued_date": "1950-01-01",
  "in_force_date": "1950-01-01",
  "url": "https://www.commonlii.org/my/legis/consol_act/ea195080/",
  "description": "An Act relating to the law of evidence. Governs the admissibility and relevancy of evidence in court proceedings. Sections 90A-90C specifically address the admissibility of computer-generated documents and electronic evidence, critical for cybercrime prosecution and digital forensics.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "Part I - Relevancy of Facts",
      "section": "1",
      "title": "Short title and extent",
      "content": "1. (1) This Act may be cited as the Evidence Act 1950. (2) This Act extends to all judicial proceedings in or before any court, but not to affidavits presented to any court or officer nor to proceedings before an arbitrator."
    },
    {
      "provision_ref": "s2",
      "chapter": "Part I - Relevancy of Facts",
      "section": "2",
      "title": "Application of Act",
      "content": "2. This Act applies to all judicial proceedings in or before any court, including courts-martial, but not to affidavits presented to any court or officer, nor to proceedings before an arbitrator."
    },
    {
      "provision_ref": "s3",
      "chapter": "Part I - Relevancy of Facts",
      "section": "3",
      "title": "Interpretation",
      "content": "3. In this Act, unless the context otherwise requires — 'court' includes all judges and magistrates and all persons, except arbitrators, legally authorized to take evidence; 'document' means any matter expressed, described, or howsoever represented, upon any substance, material, thing or article, including any matter embodied in a disc, tape, film, microfilm or in any form of mechanical or electronic device whatsoever; 'evidence' includes — (a) all statements which the court permits or requires to be made before it by witnesses, in relation to matters of fact under inquiry: such statements are called oral evidence; (b) all documents including electronic records produced for the inspection of the court: such documents are called documentary evidence; 'fact' includes — (a) any thing, state of things, or relation of things, capable of being perceived by the senses; (b) any mental condition of which any person is conscious; 'fact in issue' means and includes any fact from which either by itself or in connection with other facts, the existence, non-existence, nature or extent of any right, liability or disability asserted or denied in any suit or proceeding necessarily follows; 'proved' — a fact is said to be 'proved' when, after considering the matters before it, the court either believes it to exist or considers its existence so probable that a prudent man ought, under the circumstances of the particular case, to act upon the supposition that it exists; 'disproved' — a fact is said to be 'disproved' when, after considering the matters before it, the court either believes that it does not exist or considers its non-existence so probable that a prudent man ought, under the circumstances of the particular case, to act upon the supposition that it does not exist; 'not proved' — a fact is said to be 'not proved' when it is neither proved nor disproved."
    },
    {
      "provision_ref": "s4",
      "chapter": "Part I - Relevancy of Facts",
      "section": "4",
      "title": "Presumption",
      "content": "4. Whenever it is provided by this Act that the court may presume a fact, it may either regard such fact as proved unless and until it is disproved, or may call for proof of it. Whenever it is directed by this Act that the court shall presume a fact, it shall regard such fact as proved unless and until it is disproved. When one fact is declared by this Act to be conclusive proof of another, the court shall, on proof of the one fact, regard the other as proved, and shall not allow evidence to be given for the purpose of disproving it."
    },
    {
      "provision_ref": "s5",
      "chapter": "Part I - Relevancy of Facts",
      "section": "5",
      "title": "Evidence may be given of facts in issue and relevant facts",
      "content": "5. Evidence may be given in any suit or proceeding of the existence or non-existence of every fact in issue and of such other facts as are hereinafter declared to be relevant, and of no others."
    },
    {
      "provision_ref": "s6",
      "chapter": "Part I - Relevancy of Facts",
      "section": "6",
      "title": "Relevancy of facts forming part of same transaction",
      "content": "6. Facts which, though not in issue, are so connected with a fact in issue as to form part of the same transaction are relevant, whether they occurred at the same time and place or at different times and places."
    },
    {
      "provision_ref": "s7",
      "chapter": "Part I - Relevancy of Facts",
      "section": "7",
      "title": "Facts which are the occasion, cause, or effect of facts in issue",
      "content": "7. Facts which are the occasion, cause, or effect, immediate or otherwise, of relevant facts or facts in issue, or which constitute the state of things under which they happened or which afforded an opportunity for their occurrence or transaction, are relevant."
    },
    {
      "provision_ref": "s8",
      "chapter": "Part I - Relevancy of Facts",
      "section": "8",
      "title": "Motive, preparation and previous or subsequent conduct",
      "content": "8. (1) Any fact is relevant which shows or constitutes a motive or preparation for any fact in issue or relevant fact. (2) The conduct of any party, or of any agent to any party, to any suit or proceeding, in reference to such suit or proceeding, or in reference to any fact in issue therein or relevant thereto, and the conduct of any person an offence against whom is the subject of any proceeding, is relevant if such conduct influences or is influenced by any fact in issue or relevant fact, and whether it was previous or subsequent thereto."
    },
    {
      "provision_ref": "s14",
      "chapter": "Part I - Relevancy of Facts",
      "section": "14",
      "title": "Facts showing existence of state of mind, or of body, or bodily feeling",
      "content": "14. Facts showing the existence of any state of mind, such as intention, knowledge, good faith, negligence, rashness, ill-will or good-will towards any particular person, or showing the existence of any state of body or bodily feeling, are relevant when the existence of any such state of mind or body or bodily feeling is in issue or relevant."
    },
    {
      "provision_ref": "s15",
      "chapter": "Part I - Relevancy of Facts",
      "section": "15",
      "title": "Facts bearing on question whether act was accidental or intentional",
      "content": "15. When there is a question whether an act was accidental or intentional or done with a particular knowledge or intention, the fact that such act formed part of a series of similar occurrences, in each of which the person doing the act was concerned, is relevant."
    },
    {
      "provision_ref": "s17",
      "chapter": "Part I - Relevancy of Facts",
      "section": "17",
      "title": "Admissions defined",
      "content": "17. An admission is a statement, oral or documentary or contained in electronic form, which suggests any inference as to any fact in issue or relevant fact, and which is made by any of the persons and under the circumstances hereinafter mentioned."
    },
    {
      "provision_ref": "s45",
      "chapter": "Part I - Relevancy of Facts",
      "section": "45",
      "title": "Opinions of experts",
      "content": "45. (1) When the court has to form an opinion upon a point of foreign law or of science or art, or as to identity or genuineness of handwriting or finger impressions, the opinions upon that point of persons specially skilled in such foreign law, science or art, or in questions as to identity or genuineness of handwriting or finger impressions, are relevant facts. (2) Such persons are called experts."
    },
    {
      "provision_ref": "s57",
      "chapter": "Part II - On Proof",
      "section": "57",
      "title": "Facts of which court must take judicial notice",
      "content": "57. (1) The court shall take judicial notice of the following facts — (a) all laws in force in Malaysia; (b) all laws passed or hereafter to be passed by Parliament or any State legislature; (c) all articles of war for the armed forces; (d) the course of proceedings of Parliament and of the legislatures of the States; (e) the accession to office, names, titles, and signatures of the persons filling for the time being any public office in the Federation or any State; (f) the existence, title and national flag of every State or sovereign recognized by Malaysia; (g) the divisions of time, the geographical divisions of the world, and public festivals, fasts and holidays notified in the Gazette; (h) the territories under the sovereignty of Malaysia; (i) the commencement, continuance and termination of hostilities between Malaysia and any other State or body of persons; (j) the names of the members and officers of the court, and of their deputies and subordinate officers and assistants, and also of all officers acting in execution of its process, and of all advocates and solicitors, and other persons authorized by law to appear or act before it."
    },
    {
      "provision_ref": "s59",
      "chapter": "Part II - On Proof",
      "section": "59",
      "title": "Proof of facts by oral evidence",
      "content": "59. All facts, except the contents of documents or electronic records, may be proved by oral evidence."
    },
    {
      "provision_ref": "s60",
      "chapter": "Part II - On Proof",
      "section": "60",
      "title": "Oral evidence must be direct",
      "content": "60. (1) Oral evidence must in all cases whatever be direct — (a) if it refers to a fact which could be seen, it must be the evidence of a witness who says he saw it; (b) if it refers to a fact which could be heard, it must be the evidence of a witness who says he heard it; (c) if it refers to a fact which could be perceived by any other sense or in any other manner, it must be the evidence of a witness who says he perceived it by that sense or in that manner; (d) if it refers to an opinion or to the grounds on which that opinion is held, it must be the evidence of the person who holds that opinion on those grounds."
    },
    {
      "provision_ref": "s62",
      "chapter": "Part II - On Proof",
      "section": "62",
      "title": "Primary evidence",
      "content": "62. Primary evidence means the document itself produced for the inspection of the court. Where a document has been executed in several parts, each part shall be primary evidence of the document. Where a document has been executed in counterpart, each counterpart being executed by one or some of the parties only, each counterpart shall be primary evidence as against the parties executing it. Where a number of documents have all been made by one uniform process, as in the case of printing, lithography, or photography, each shall be primary evidence of the contents of the rest; but where they are all copies of a common original they shall not be primary evidence of the contents of the original."
    },
    {
      "provision_ref": "s63",
      "chapter": "Part II - On Proof",
      "section": "63",
      "title": "Secondary evidence",
      "content": "63. Secondary evidence means and includes — (a) certified copies given under the provisions hereinafter contained; (b) copies made from the original by mechanical processes, which in themselves ensure the accuracy of the copy, and copies compared with such copies; (c) copies made from or compared with the original; (d) counterparts of documents as against the parties who did not execute them; (e) oral accounts of the contents of a document given by some person who has himself seen it."
    },
    {
      "provision_ref": "s64",
      "chapter": "Part II - On Proof",
      "section": "64",
      "title": "Proof of documents by primary evidence",
      "content": "64. Documents must be proved by primary evidence except in the cases hereinafter mentioned."
    },
    {
      "provision_ref": "s65",
      "chapter": "Part II - On Proof",
      "section": "65",
      "title": "Cases in which secondary evidence relating to documents may be given",
      "content": "65. Secondary evidence may be given of the existence, condition or contents of a document in the following cases — (a) when the original is shown or appears to be in the possession or power of the person against whom the document is sought to be proved, or of any person out of reach of or not subject to the process of the court, or of any person legally bound to produce it, and when, after the notice mentioned in section 66, such person does not produce it; (b) when the existence, condition or contents of the original have been proved to be admitted in writing by the person against whom it is proved or by his representative in interest; (c) when the original has been destroyed or lost, or when the party offering evidence of its contents cannot for any other reason not arising from his own default or neglect produce it in reasonable time; (d) when the original is of such a nature as not to be easily movable; (e) when the original is a public document within the meaning of section 74; (f) when the original is a document of which a certified copy is permitted by this Act or by any other law in force in Malaysia to be given in evidence; (g) when the originals consist of numerous accounts or other documents which cannot conveniently be examined in court, and the fact to be proved is the general result of the whole collection."
    },
    {
      "provision_ref": "s73A",
      "chapter": "Part II - On Proof",
      "section": "73A",
      "title": "Proof as to digital signature",
      "content": "73A. (1) In order to ascertain whether a digital signature is that of the person by whom it purports to have been affixed, the court may direct — (a) that person or the controller of the certification authority to produce the digital signature certificate; (b) any other person to apply the public key listed in the digital signature certificate and verify the digital signature purported to have been affixed by that person. (2) Any person who receives a digital signature certificate from the controller of a certification authority may verify the digital signature purported to have been affixed by the person identified in the digital signature certificate."
    },
    {
      "provision_ref": "s73AA",
      "chapter": "Part II - On Proof",
      "section": "73AA",
      "title": "Proof as to electronic signature (other than digital signature)",
      "content": "73AA. (1) Except in the case of a digital signature, where any law provides that any document or information shall be authenticated by affixing the signature or any document shall be signed, the requirement of that law is satisfied if such authentication or signing is effected by an electronic signature. (2) In any proceeding involving a secure electronic signature, if the court is satisfied that — (a) the signature creation data was linked to no other person; (b) the signature creation data was under the control of that person at the time of signing; and (c) any alteration to the electronic signature, made after the time of signing, is detectable, then such electronic signature shall be regarded as a secure electronic signature."
    },
    {
      "provision_ref": "s73B",
      "chapter": "Part II - On Proof",
      "section": "73B",
      "title": "Presumption as to electronic messages",
      "content": "73B. The court shall presume, unless the contrary is proved, that — (a) the electronic message was sent by the originator and received by the addressee; (b) the electronic message that the addressee received is the same as the electronic message sent by the originator; (c) the time of receipt of an electronic message shall be the time when the electronic message enters the designated information system of the addressee."
    },
    {
      "provision_ref": "s73C",
      "chapter": "Part II - On Proof",
      "section": "73C",
      "title": "Presumption as to electronic records five years old",
      "content": "73C. Where any electronic record is five years old, purporting or proved to have been in proper custody, the court may presume that the digital signature which purports to be the digital signature of any particular person was so affixed by him or any person authorised by him in this behalf."
    },
    {
      "provision_ref": "s90A",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "90A",
      "title": "Admissibility of documents produced by computers",
      "content": "90A. (1) In any criminal or civil proceeding, a document produced by a computer, or a statement contained in such document, shall be admissible as evidence of any fact stated therein if the document was produced by the computer in the course of its ordinary use, whether or not the person tendering it is the maker of such document or statement. (2) For the purposes of this section — (a) a document shall be deemed to have been produced by a computer whether it was produced by it directly or, with or without human intervention, by means of any appropriate equipment; (b) it shall be sufficient to show that the computer was operating properly or, if not, that any respect in which it was not operating properly or was out of operation was not such as to affect the production of the document or the accuracy of its contents. (3) For the purposes of this section, a certificate — (a) identifying the document containing the statement and describing the manner in which it was produced; (b) giving such particulars of any device involved in the production of that document as may be appropriate for the purpose of showing that the document was produced by a computer; (c) dealing with any of the matters to which the conditions mentioned in subsection (2) relate, and purporting to be signed by a person occupying a responsible position in relation to the operation of the relevant device or the management of the relevant activities, shall be evidence of anything stated therein. (4) Where a document is produced by more than one computer, the certificate may be signed by a person occupying a responsible position in relation to any of the computers involved."
    },
    {
      "provision_ref": "s90B",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "90B",
      "title": "Weight to be attached to document",
      "content": "90B. In estimating the weight, if any, to be attached to a document or statement admissible in evidence by virtue of section 90A, regard shall be had to all the circumstances from which any inference can reasonably be drawn as to the accuracy or otherwise of the document or statement, and in particular — (a) whether or not the information which the document or statement being tendered in evidence reproduces or is derived from was supplied to the relevant computer, or recorded for the purpose of being supplied thereto, contemporaneously with the occurrence or existence of the facts dealt with in that information; and (b) whether or not the supplier of the relevant information, or any person concerned with the operation of the relevant computer at any material time, had any incentive to conceal or misrepresent the facts."
    },
    {
      "provision_ref": "s90C",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "90C",
      "title": "Proof as to conditions of admissibility",
      "content": "90C. (1) For the purposes of deciding whether or not a statement is admissible in evidence by virtue of section 90A, the court may draw any reasonable inference from the circumstances in which the statement was made or otherwise came into being or from any other circumstances, including the form and contents of the document in which the statement is contained. (2) In estimating the weight to be attached to a statement admissible by virtue of section 90A, regard shall be had to all the circumstances from which any inference can reasonably be drawn as to the accuracy or otherwise of the statement. (3) Without prejudice to the generality of subsection (2), in estimating the weight to be attached to a statement regard shall be had to — (a) the question whether or not the statement was made or information supplied contemporaneously with the occurrence or existence of the facts stated; and (b) the question whether or not the maker of the statement, or the supplier of the information, had any incentive to conceal or misrepresent any fact."
    },
    {
      "provision_ref": "s90D",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "90D",
      "title": "Computer output as secondary evidence",
      "content": "90D. A printout of data stored in a computer, or any other output of the computer that is shown to accurately reproduce such data, shall be admissible as secondary evidence of the contents of the original data."
    },
    {
      "provision_ref": "s91",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "91",
      "title": "Evidence of terms of contracts, grants, and other dispositions of property reduced to form of document",
      "content": "91. When the terms of a contract, or of a grant, or of any other disposition of property, have been reduced to the form of a document, and in all cases in which any matter is required by law to be reduced to the form of a document, no evidence shall be given in proof of the terms of such contract, grant, or other disposition of property or of such matter except the document itself, or secondary evidence of its contents in cases in which secondary evidence is admissible under the provisions hereinbefore contained."
    },
    {
      "provision_ref": "s92",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "92",
      "title": "Exclusion of evidence of oral agreement",
      "content": "92. When the terms of any such contract, grant, or other disposition of property, or any matter required by law to be reduced to the form of a document, have been proved according to section 91, no evidence of any oral agreement or statement shall be admitted as between the parties to any such instrument, or their representatives in interest, for the purpose of contradicting, varying, adding to, or subtracting from its terms. However, this section does not apply to — (a) any fact which would invalidate any document or which would entitle any person to any decree or order relating thereto; (b) the existence of any separate oral agreement as to any matter on which a document is silent, and which is not inconsistent with its terms; (c) the existence of any separate oral agreement constituting a condition precedent to the attaching of any obligation under any such contract, grant or disposition of property; (d) any distinct subsequent oral agreement to rescind or modify any such contract, grant or disposition of property; (e) any usage or custom by which incidents not expressly mentioned in any contract are usually annexed to contracts of that description; or (f) any fact which shows in what manner the language of a document is related to existing facts."
    },
    {
      "provision_ref": "s101",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "101",
      "title": "Burden of proof",
      "content": "101. (1) Whoever desires any court to give judgment as to any legal right or liability, dependent on the existence of facts which he asserts, must prove that those facts exist. (2) When a person is bound to prove the existence of any fact, it is said that the burden of proof lies on that person. (3) The burden of proof in a suit or proceeding lies on that person who would fail if no evidence at all were given on either side."
    },
    {
      "provision_ref": "s102",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "102",
      "title": "On whom burden of proof lies",
      "content": "102. The burden of proof in a suit or proceeding lies on that person who would fail if no evidence at all were given on either side."
    },
    {
      "provision_ref": "s103",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "103",
      "title": "Burden of proof as to particular fact",
      "content": "103. The burden of proof as to any particular fact lies on that person who wishes the court to believe in its existence, unless it is provided by any law that the proof of that fact shall lie on any particular person."
    },
    {
      "provision_ref": "s114",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "114",
      "title": "Court may presume existence of certain facts",
      "content": "114. The court may presume the existence of any fact which it thinks likely to have happened, regard being had to the common course of natural events, human conduct, and public and private business, in their relation to the facts of the particular case. The court may presume — (a) that a man who is in possession of stolen goods soon after the theft is either the thief or has received the goods knowing them to be stolen, unless he can account for his possession; (b) that an accomplice is unworthy of credit unless he is corroborated in material particulars; (c) that a bill of exchange, accepted or endorsed, was accepted or endorsed for good consideration; (d) that a thing or state of things which has been shown to be in existence within a period shorter than that within which such things or states of things usually cease to exist is still in existence; (e) that judicial and official acts have been regularly performed; (f) that the common course of business has been followed in particular cases; (g) that evidence which could be and is not produced would, if produced, be unfavourable to the person who withholds it; (h) that if a man refuses to answer a question which he is not compelled to answer by law, the answer if given would be unfavourable to him; (i) that when a document creating an obligation is in the hands of the obligor, the obligation has been discharged."
    },
    {
      "provision_ref": "s114A",
      "chapter": "Part III - Production and Effect of Evidence",
      "section": "114A",
      "title": "Presumption of fact in publication",
      "content": "114A. (1) A person whose name, photograph or pseudonym appears on any publication depicting himself as the owner, host, administrator, editor or sub-editor, or who in any manner facilitates to publish or re-publish the publication is presumed to have published or re-published the contents of the publication unless the contrary is proved. (2) A person who is registered with a network service provider as a subscriber of a network service on which any publication originates from is presumed to be the person who published or re-published the publication unless the contrary is proved. (3) Any person who has in his custody or control any computer on which any publication originates from is presumed to have published or re-published the contents of the publication unless the contrary is proved."
    }
  ],
  "definitions": [
    {
      "term": "document",
      "definition": "Any matter expressed, described, or howsoever represented, upon any substance, material, thing or article, including any matter embodied in a disc, tape, film, microfilm or in any form of mechanical or electronic device whatsoever.",
      "source_provision": "s3"
    },
    {
      "term": "evidence",
      "definition": "Includes (a) all statements which the court permits or requires to be made before it by witnesses, in relation to matters of fact under inquiry (oral evidence); (b) all documents including electronic records produced for the inspection of the court (documentary evidence).",
      "source_provision": "s3"
    },
    {
      "term": "fact",
      "definition": "Includes any thing, state of things, or relation of things, capable of being perceived by the senses, and any mental condition of which any person is conscious.",
      "source_provision": "s3"
    },
    {
      "term": "proved",
      "definition": "A fact is said to be proved when, after considering the matters before it, the court either believes it to exist or considers its existence so probable that a prudent man ought, under the circumstances of the particular case, to act upon the supposition that it exists.",
      "source_provision": "s3"
    },
    {
      "term": "court",
      "definition": "Includes all judges and magistrates and all persons, except arbitrators, legally authorized to take evidence.",
      "source_provision": "s3"
    }
  ]
}
