{
  "id": "federal-constitution",
  "type": "statute",
  "title": "Perlembagaan Persekutuan",
  "title_en": "Federal Constitution",
  "short_name": "Federal Constitution",
  "status": "in_force",
  "issued_date": "1957-08-31",
  "in_force_date": "1957-08-31",
  "url": "https://www.commonlii.org/my/legis/consol_act/fc/",
  "description": "The supreme law of the Federation of Malaysia. Establishes the structure of government, fundamental liberties of citizens, citizenship provisions, federal-state relations, and special powers of Parliament. Articles 5-13 on fundamental liberties are key for digital rights, privacy, and freedom of expression in the digital age.",
  "provisions": [
    {
      "provision_ref": "art4",
      "chapter": "PART I - THE STATES, RELIGION AND LAW OF THE FEDERATION",
      "section": "4",
      "title": "Supreme law of the Federation",
      "content": "4. (1) This Constitution is the supreme law of the Federation and any law passed after Merdeka Day which is inconsistent with this Constitution shall, to the extent of the inconsistency, be void. (2) The validity of any law made by Parliament or the Legislature of any State shall not be questioned on the ground that it makes provision with respect to any matter with respect to which Parliament or, as the case may be, the Legislature of the State has no power to make laws, except in proceedings for a declaration that the law is invalid on that ground."
    },
    {
      "provision_ref": "art5",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "5",
      "title": "Liberty of the person",
      "content": "5. (1) No person shall be deprived of his life or personal liberty save in accordance with law. (2) Where complaint is made to a High Court or any judge thereof that a person is being unlawfully detained, the court shall inquire into the complaint and, unless satisfied that the detention is lawful, shall order him to be produced before the court and release him. (3) Where a person is arrested he shall be informed as soon as may be of the grounds of his arrest and shall be allowed to consult and be defended by a legal practitioner of his choice. (4) Where a person is arrested and not released, he shall without unreasonable delay, and in any case within twenty-four hours (excluding the time of any necessary journey) be produced before a magistrate and shall not be further detained in custody without the magistrate's authority."
    },
    {
      "provision_ref": "art6",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "6",
      "title": "Slavery and forced labour prohibited",
      "content": "6. (1) No person shall be held in slavery. (2) All forms of forced labour are prohibited, but Parliament may by law provide for compulsory service for national purposes. (3) Work incidental to the serving of a sentence of imprisonment imposed by a court of law shall not be taken to be forced labour within the meaning of this Article. (4) Where by any written law the whole or any part of the functions of any public authority is to be carried on by another public authority, for the purpose of enabling those functions to be performed the employees of the first-mentioned public authority shall be bound to serve the second-mentioned public authority."
    },
    {
      "provision_ref": "art7",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "7",
      "title": "Protection against retrospective criminal laws and repeated trials",
      "content": "7. (1) No person shall be punished for an act or omission which was not punishable by law when it was done or made, and no person shall suffer greater punishment for an offence than was prescribed by law at the time it was committed. (2) A person who has been acquitted or convicted of an offence shall not be tried again for the same offence except where the conviction or acquittal has been quashed and a retrial ordered by a court superior to that by which he was acquitted or convicted."
    },
    {
      "provision_ref": "art8",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "8",
      "title": "Equality",
      "content": "8. (1) All persons are equal before the law and entitled to the equal protection of the law. (2) Except as expressly authorized by this Constitution, there shall be no discrimination against citizens on the ground only of religion, race, descent, place of birth or gender in any law or in the appointment to any office or employment under a public authority or in the administration of any law relating to the acquisition, holding or disposition of property or the establishing or carrying on of any trade, business, profession, vocation or employment. (3) There shall be no discrimination in favour of any person on the ground that he is a subject of the Ruler of any State. (4) No public authority shall discriminate against any person on the ground that he is resident or carrying on business in any part of the Federation outside the jurisdiction of the authority. (5) This Article does not invalidate or prohibit — (a) any provision regulating personal law; (b) any provision or practice restricting office or employment connected with the affairs of any religion, or of an institution managed by a group professing any religion, to persons professing that religion; (c) any provision for the protection, well-being or advancement of the aboriginal peoples of the Malay Peninsula or of any other underprivileged group; (d) any provision prescribed by or under any law fixing a minimum proportion of persons of any race to be employed by any authority or in any body."
    },
    {
      "provision_ref": "art9",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "9",
      "title": "Prohibition of banishment and freedom of movement",
      "content": "9. (1) No citizen shall be banished or excluded from the Federation. (2) Subject to Clause (3) and to any law relating to the security of the Federation or any part thereof, public order, public health, or the punishment of offenders, every citizen has the right to move freely throughout the Federation and to reside in any part thereof. (3) So long as under this Constitution any other State is in a special position as compared with the States of Malaya, Parliament may by law impose restrictions, as between that State and the States of Malaya, on the rights conferred by Clause (2) in respect of movement and residence."
    },
    {
      "provision_ref": "art10",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "10",
      "title": "Freedom of speech, assembly and association",
      "content": "10. (1) Subject to Clauses (2), (3) and (4) — (a) every citizen has the right to freedom of speech and expression; (b) all citizens have the right to assemble peaceably and without arms; (c) all citizens have the right to form associations. (2) Parliament may by law impose — (a) on the rights conferred by paragraph (a) of Clause (1), such restrictions as it deems necessary or expedient in the interest of the security of the Federation or any part thereof, friendly relations with other countries, public order or morality and restrictions designed to protect the privileges of Parliament or of any Legislative Assembly or to provide against contempt of court, defamation, or incitement to any offence; (b) on the right conferred by paragraph (b) of Clause (1), such restrictions as it deems necessary or expedient in the interest of the security of the Federation or any part thereof or public order; (c) on the right conferred by paragraph (c) of Clause (1), such restrictions as it deems necessary or expedient in the interest of the security of the Federation or any part thereof, public order or morality. (3) Restrictions on the right to form associations conferred by paragraph (c) of Clause (1) may also be imposed by any law relating to labour or education. (4) In imposing restrictions in the interest of the security of the Federation or any part thereof or public order under Clause (2)(a), Parliament may pass law prohibiting the questioning of any matter, right, status, position, privilege, sovereignty or prerogative established or protected by the provisions of Part III, Article 152, 153 or 181."
    },
    {
      "provision_ref": "art11",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "11",
      "title": "Freedom of religion",
      "content": "11. (1) Every person has the right to profess and practise his religion and, subject to Clause (4), to propagate it. (2) No person shall be compelled to pay any tax the proceeds of which are specially allocated in whole or in part for the purposes of a religion other than his own. (3) Every religious group has the right — (a) to manage its own religious affairs; (b) to establish and maintain institutions for religious or charitable purposes; and (c) to acquire and own property and hold and administer it in accordance with law. (4) State law and in respect of the Federal Territories of Kuala Lumpur, Putrajaya and Labuan, federal law may control or restrict the propagation of any religious doctrine or belief among persons professing the religion of Islam."
    },
    {
      "provision_ref": "art12",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "12",
      "title": "Rights in respect of education",
      "content": "12. (1) Without prejudice to the generality of Article 8, there shall be no discrimination against any citizen on the grounds only of religion, race, descent or place of birth — (a) in the administration of any educational institution maintained by a public authority, and, in particular, the admission of pupils or students or the payment of fees; or (b) in providing out of the funds of a public authority financial aid for the maintenance or education of pupils or students in any educational institution. (2) Every religious group has the right to establish and maintain institutions for the education of children in its own religion, and there shall be no discrimination on the ground only of religion in any law relating to such institutions or in the administration of any such law."
    },
    {
      "provision_ref": "art13",
      "chapter": "PART II - FUNDAMENTAL LIBERTIES",
      "section": "13",
      "title": "Rights to property",
      "content": "13. (1) No person shall be deprived of property save in accordance with law. (2) No law shall provide for the compulsory acquisition or use of property without adequate compensation."
    },
    {
      "provision_ref": "art32",
      "chapter": "PART IV - THE FEDERATION",
      "section": "32",
      "title": "Supreme Head of the Federation",
      "content": "32. (1) There shall be a Supreme Head of the Federation, to be called the Yang di-Pertuan Agong, who shall take precedence over all persons in the Federation and shall not be liable to any proceedings whatsoever in any court except in the Special Court established under Part XV."
    },
    {
      "provision_ref": "art39",
      "chapter": "PART IV - THE FEDERATION",
      "section": "39",
      "title": "Executive authority of Federation",
      "content": "39. The executive authority of the Federation shall be vested in the Yang di-Pertuan Agong and exercisable, subject to the provisions of any federal law and of the Second Schedule, by him or by the Cabinet or any Minister authorised by the Cabinet, but Parliament may by law confer executive functions on other persons."
    },
    {
      "provision_ref": "art40",
      "chapter": "PART IV - THE FEDERATION",
      "section": "40",
      "title": "Yang di-Pertuan Agong to act on advice",
      "content": "40. (1) In the exercise of his functions under this Constitution or federal law the Yang di-Pertuan Agong shall act in accordance with the advice of the Cabinet or of a Minister acting under the general authority of the Cabinet, except as otherwise provided by this Constitution; but shall be entitled, at his request, to any information concerning the government of the Federation which is available to the Cabinet. (2) The Yang di-Pertuan Agong may act in his discretion in the performance of the following functions, that is to say — (a) the appointment of a Prime Minister; (b) the withholding of consent to a request for the dissolution of Parliament; (c) the requisition of a meeting of the Conference of Rulers concerned solely with the privileges, position, honours and dignities of Their Royal Highnesses."
    },
    {
      "provision_ref": "art44",
      "chapter": "PART IV - THE FEDERATION",
      "section": "44",
      "title": "Constitution of Parliament",
      "content": "44. The legislative authority of the Federation shall be vested in a Parliament, which shall consist of the Yang di-Pertuan Agong and two Majlis (Houses of Parliament) to be known as the Dewan Negara (Senate) and the Dewan Rakyat (House of Representatives)."
    },
    {
      "provision_ref": "art121",
      "chapter": "PART IX - THE JUDICIARY",
      "section": "121",
      "title": "Judicial power of the Federation",
      "content": "121. (1) There shall be two High Courts of co-ordinate jurisdiction and status, namely — (a) one in the States of Malaya, which shall be known as the High Court in Malaya and shall have its principal registry in Kuala Lumpur; and (b) one in the States of Sabah and Sarawak, which shall be known as the High Court in Sabah and Sarawak and shall have its principal registry at such place in the States of Sabah and Sarawak as the Yang di-Pertuan Agong may determine; and such inferior courts as may be provided by federal law; and the High Courts and inferior courts shall have such jurisdiction and powers as may be conferred by or under federal law. (1A) The courts referred to in Clause (1) shall have no jurisdiction in respect of any matter within the jurisdiction of the Syariah courts."
    },
    {
      "provision_ref": "art135",
      "chapter": "PART X - PUBLIC SERVICES",
      "section": "135",
      "title": "Restriction on dismissal and reduction in rank",
      "content": "135. (1) No member of any of the services mentioned in paragraphs (b) to (h) of Clause (1) of Article 132 shall be dismissed or reduced in rank by an authority subordinate to that which, at the time of the dismissal or reduction, has power to appoint a member of that service of equal rank. (2) No such member as aforesaid shall be dismissed or reduced in rank without being given a reasonable opportunity of being heard."
    },
    {
      "provision_ref": "art145",
      "chapter": "PART X - PUBLIC SERVICES",
      "section": "145",
      "title": "Attorney General",
      "content": "145. (1) The Yang di-Pertuan Agong shall, on the advice of the Prime Minister, appoint a person who is qualified to be a judge of the Federal Court to be the Attorney General for the Federation. (2) It shall be the duty of the Attorney General to advise the Yang di-Pertuan Agong or the Cabinet or any Minister upon such legal matters, and to perform such other duties of a legal character, as may from time to time be referred or assigned to him by the Yang di-Pertuan Agong or the Cabinet, and to discharge the functions conferred on him by or under this Constitution or any other written law. (3) The Attorney General shall have power, exercisable at his discretion, to institute, conduct or discontinue any proceedings for an offence, other than proceedings before a Syariah court, a native court or a court-martial."
    },
    {
      "provision_ref": "art149",
      "chapter": "PART XI - SPECIAL POWERS AGAINST SUBVERSION, ORGANISED VIOLENCE, AND ACTS AND CRIMES PREJUDICIAL TO THE PUBLIC",
      "section": "149",
      "title": "Legislation against subversion, action prejudicial to public order, etc.",
      "content": "149. (1) If an Act of Parliament recites that action has been taken or threatened by any substantial body of persons, whether inside or outside the Federation — (a) to cause, or to cause a substantial number of citizens to fear, organized violence against persons or property; or (b) to excite disaffection against the Yang di-Pertuan Agong or any Government in the Federation; or (c) to promote feelings of ill-will and hostility between different races or other classes of the population likely to cause violence; or (d) to procure the alteration, otherwise than by lawful means, of anything by law established; or (e) which is prejudicial to the maintenance or the functioning of any supply or service to the public or any class of the public in the Federation or any part thereof; or (f) which is prejudicial to public order in, or the security of, the Federation or any part thereof, any provision of that law designed to stop or prevent that action is valid notwithstanding that it is inconsistent with any of the provisions of Article 5, 9, 10 or 13, or would apart from this Article be outside the legislative power of Parliament; and Article 79 shall not apply to a Bill for such an Act or any amendment to such a Bill."
    },
    {
      "provision_ref": "art150",
      "chapter": "PART XI - SPECIAL POWERS AGAINST SUBVERSION, ORGANISED VIOLENCE, AND ACTS AND CRIMES PREJUDICIAL TO THE PUBLIC",
      "section": "150",
      "title": "Proclamation of emergency",
      "content": "150. (1) If the Yang di-Pertuan Agong is satisfied that a grave emergency exists whereby the security, or the economic life, or public order in the Federation or any part thereof is threatened, he may issue a Proclamation of Emergency making therein a declaration to that effect. (2) A Proclamation of Emergency under Clause (1) may be issued before the actual occurrence of the event which threatens the security, or the economic life, or public order in the Federation or any part thereof if the Yang di-Pertuan Agong is satisfied that there is imminent danger of the occurrence of such event. (3) A Proclamation of Emergency and any ordinance promulgated under Article 150 shall be laid before both Houses of Parliament and, if not sooner revoked, shall cease to have effect if resolutions are passed by both Houses annulling such Proclamation or ordinance. (6) During a period of emergency the executive authority of the Federation shall, notwithstanding anything in this Constitution, extend to any matter within the legislative authority of a State."
    },
    {
      "provision_ref": "art152",
      "chapter": "PART XII - GENERAL AND MISCELLANEOUS",
      "section": "152",
      "title": "National language",
      "content": "152. (1) The national language shall be the Malay language and shall be in such script as Parliament may by law provide: Provided that — (a) no person shall be prohibited or prevented from using (otherwise than for official purposes), or from teaching or learning, any other language; and (b) nothing in this Clause shall prejudice the right of the Federal Government or of any State Government to preserve and sustain the use and study of the language of any other community in the Federation."
    },
    {
      "provision_ref": "art153",
      "chapter": "PART XII - GENERAL AND MISCELLANEOUS",
      "section": "153",
      "title": "Reservation of quotas in respect of services, permits, etc., for Malays and natives of any of the States of Sabah and Sarawak",
      "content": "153. (1) It shall be the responsibility of the Yang di-Pertuan Agong to safeguard the special position of the Malays and natives of any of the States of Sabah and Sarawak and the legitimate interests of other communities in accordance with the provisions of this Article. (2) Notwithstanding anything in this Constitution, but subject to the provisions of Article 40 and of this Article, the Yang di-Pertuan Agong shall exercise his functions under this Constitution and federal law in such manner as may be necessary to safeguard the special provision of the Malays and natives of any of the States of Sabah and Sarawak and to ensure the reservation for Malays and natives of any of the States of Sabah and Sarawak of such proportion as he may deem reasonable of positions in the public service and of scholarships, exhibitions and other similar educational or training privileges or special facilities given or accorded by the Federal Government."
    },
    {
      "provision_ref": "art154",
      "chapter": "PART XII - GENERAL AND MISCELLANEOUS",
      "section": "154",
      "title": "Commonwealth reciprocity",
      "content": "154. (1) Parliament may make provision for reciprocal arrangements with the governments of other Commonwealth countries, in relation to residence, business, professions, trade and social security in those countries, as between those countries and the Federation. (2) In implementing such arrangements, Parliament may grant special treatment to citizens of other Commonwealth countries."
    },
    {
      "provision_ref": "art155",
      "chapter": "PART XII - GENERAL AND MISCELLANEOUS",
      "section": "155",
      "title": "Restriction on dispositions of lands in Malay reservations",
      "content": "155. Nothing in this Constitution shall affect the validity of any restriction imposed by law on the transfer or leasing of any land in a Malay reservation or on any interest in such land."
    },
    {
      "provision_ref": "art159",
      "chapter": "PART XII - GENERAL AND MISCELLANEOUS",
      "section": "159",
      "title": "Amendment of the Constitution",
      "content": "159. (1) Subject to the following provisions of this Article and to Article 161E, the provisions of this Constitution may be amended by federal law. (2) No amendment shall be made to this Constitution unless the Bill for the same has been supported on Second and Third Readings by the votes of not less than two-thirds of the total number of members of each House of Parliament. (3) No amendment shall be made to the Constitution affecting the provisions relating to — (a) the position of the Malay Rulers; (b) the rights of the Malays and the natives of Sabah and Sarawak; (c) the position of Islam; (d) citizenship; (e) the national language, unless with the consent of the Conference of Rulers. (4) No amendment to Part III of this Constitution or to this Article shall be passed without the consent of the Conference of Rulers. (5) A law making an amendment to Clause (4) of Article 10, any law passed thereunder, to Part III, to Articles 38, 63(4), 70, 71(1), 72(4), 152, or 153 or to this Clause shall not be passed without the consent of the Conference of Rulers."
    },
    {
      "provision_ref": "art160",
      "chapter": "PART XII - GENERAL AND MISCELLANEOUS",
      "section": "160",
      "title": "Interpretation",
      "content": "160. (1) In this Constitution, unless the context otherwise requires — 'citizen' means a citizen of the Federation; 'Federation' means the Federation established under the Federation of Malaya Agreement 1957, as the territories comprised therein may from time to time be altered, and includes any territories admitted to the Federation after Malaysia Day; 'law' includes written law, the common law in so far as it is in operation in the Federation or any part thereof, and any custom or usage having the force of law in the Federation or any part thereof; 'Malay' means a person who professes the religion of Islam, habitually speaks the Malay language, conforms to Malay custom; 'written law' includes this Constitution and the Constitution of any State."
    }
  ],
  "definitions": [
    {
      "term": "citizen",
      "definition": "A citizen of the Federation.",
      "source_provision": "art160"
    },
    {
      "term": "Federation",
      "definition": "The Federation established under the Federation of Malaya Agreement 1957, as the territories comprised therein may from time to time be altered, and includes any territories admitted to the Federation after Malaysia Day.",
      "source_provision": "art160"
    },
    {
      "term": "law",
      "definition": "Includes written law, the common law in so far as it is in operation in the Federation or any part thereof, and any custom or usage having the force of law in the Federation or any part thereof.",
      "source_provision": "art160"
    },
    {
      "term": "written law",
      "definition": "Includes the Federal Constitution and the Constitution of any State.",
      "source_provision": "art160"
    }
  ]
}
