{
  "id": "penal-code",
  "type": "statute",
  "title": "Kanun Keseksaan",
  "title_en": "Penal Code",
  "short_name": "Penal Code",
  "status": "in_force",
  "issued_date": "1936-01-01",
  "in_force_date": "1936-01-01",
  "url": "https://www.commonlii.org/my/legis/consol_act/pc182/",
  "description": "The principal criminal code of Malaysia. Covers a comprehensive range of offences including those against the state, public tranquillity, the human body, and property. Provisions on theft, extortion, fraud, cheating, forgery (including electronic documents), criminal breach of trust, mischief (including computer damage), defamation, and criminal intimidation are particularly relevant to cybercrime and digital fraud.",
  "provisions": [
    {
      "provision_ref": "s378",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "378",
      "title": "Theft",
      "content": "378. Whoever, intending to take dishonestly any movable property out of the possession of any person without that person's consent, moves that property in order to such taking, is said to commit theft. Explanation 1. — A thing so long as it is attached to the earth, not being movable property, is not the subject of theft; but it becomes capable of being the subject of theft as soon as it is severed from the earth. Explanation 2. — A moving effected by the same act which effects the severance may be a theft. Explanation 3. — A person is said to cause a thing to move by removing an obstacle which prevented it from moving, or by separating it from any other thing, as well as by actually moving it. Explanation 4. — A person who by any means causes an animal to move is said to move that animal, and to move everything which in consequence of the motion so caused is moved by that animal. Explanation 5. — The consent mentioned in the definition may be express or implied, and may be given either by the person in possession or by any person having for that purpose authority either express or implied."
    },
    {
      "provision_ref": "s379",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "379",
      "title": "Punishment for theft",
      "content": "379. Whoever commits theft shall be punished with imprisonment for a term which may extend to seven years or with fine or with both, and for a second or subsequent offence shall be punished with imprisonment and shall also be liable to fine or to whipping."
    },
    {
      "provision_ref": "s380",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "380",
      "title": "Theft in dwelling-house, etc.",
      "content": "380. Whoever commits theft in any building, tent or vessel, which building, tent or vessel is used as a human dwelling, or for the custody of property, shall be punished with imprisonment for a term which may extend to ten years and with fine, and for a second or subsequent offence shall be punished with imprisonment and shall also be liable to fine or to whipping."
    },
    {
      "provision_ref": "s381",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "381",
      "title": "Theft by clerk or servant of property in possession of master",
      "content": "381. Whoever, being a clerk or servant, or being employed in the capacity of a clerk or servant, commits theft in respect of any property in the possession of his master or employer, shall be punished with imprisonment for a term which may extend to fourteen years, and with whipping, and shall also be liable to fine."
    },
    {
      "provision_ref": "s382",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "382",
      "title": "Theft after preparation made for causing death, hurt, or restraint, in order to the committing of the theft",
      "content": "382. Whoever commits theft, having made preparation for causing death, or hurt, or restraint, or fear of death, or of hurt, or of restraint, to any person, in order to the committing of such theft, or in order to the effecting of his escape after the committing of such theft, or in order to the retaining of property taken by such theft, shall be punished with imprisonment for a term which may extend to ten years, and with whipping, and shall also be liable to fine."
    },
    {
      "provision_ref": "s383",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "383",
      "title": "Extortion",
      "content": "383. Whoever intentionally puts any person in fear of any injury to that person or to any other, and thereby dishonestly induces the person so put in fear to deliver to any person any property or valuable security, or anything signed or sealed which may be converted into a valuable security, commits extortion."
    },
    {
      "provision_ref": "s384",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "384",
      "title": "Punishment for extortion",
      "content": "384. Whoever commits extortion shall be punished with imprisonment for a term which may extend to ten years and with whipping, and shall also be liable to fine."
    },
    {
      "provision_ref": "s385",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "385",
      "title": "Putting person in fear of injury in order to commit extortion",
      "content": "385. Whoever, in order to the committing of extortion, puts or attempts to put any person in fear of injury to that person or to any other, shall be punished with imprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
      "provision_ref": "s390",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "390",
      "title": "Robbery",
      "content": "390. In all robbery there is either theft or extortion. When theft is robbery — Theft is 'robbery' if, in order to the committing of the theft, or in committing the theft, or in carrying away or attempting to carry away property obtained by the theft, the offender, for that end, voluntarily causes or attempts to cause to any person death, or hurt, or wrongful restraint, or fear of instant death, or of instant hurt, or of instant wrongful restraint. When extortion is robbery — Extortion is 'robbery' if the offender, at the time of committing the extortion, is in the presence of the person put in fear, and commits the extortion by putting that person in fear of instant death, of instant hurt, or of instant wrongful restraint to that person or to some other person, and, by so putting in fear, induces the person so put in fear then and there to deliver up the thing extorted."
    },
    {
      "provision_ref": "s392",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "392",
      "title": "Punishment for robbery",
      "content": "392. Whoever commits robbery shall be punished with imprisonment for a term which may extend to fourteen years, and shall also be liable to fine or to whipping."
    },
    {
      "provision_ref": "s395",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "395",
      "title": "Punishment for gang-robbery",
      "content": "395. Whoever commits gang-robbery shall be punished with imprisonment for a term which shall not be less than five years and not more than twenty years, and shall also be liable to whipping."
    },
    {
      "provision_ref": "s403",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "403",
      "title": "Dishonest misappropriation of property",
      "content": "403. Whoever dishonestly misappropriates, or converts to his own use, any movable property, shall be punished with imprisonment for a term which may extend to five years, or with fine, or with both."
    },
    {
      "provision_ref": "s405",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "405",
      "title": "Criminal breach of trust",
      "content": "405. Whoever, being in any manner entrusted with property, or with any dominion over property, dishonestly misappropriates, or converts to his own use, that property, or dishonestly uses or disposes of that property in violation of any direction of law prescribing the mode in which such trust is to be discharged, or of any legal contract, express or implied, which he has made touching the discharge of such trust, or wilfully suffers any other person so to do, commits criminal breach of trust."
    },
    {
      "provision_ref": "s406",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "406",
      "title": "Punishment for criminal breach of trust",
      "content": "406. Whoever commits criminal breach of trust shall be punished with imprisonment for a term which may extend to ten years and with whipping, and shall also be liable to fine."
    },
    {
      "provision_ref": "s408",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "408",
      "title": "Criminal breach of trust by clerk or servant",
      "content": "408. Whoever, being a clerk or servant, or employed as a clerk or servant, and being in any manner entrusted in such capacity with property, or with any dominion over property, commits criminal breach of trust in respect of that property, shall be punished with imprisonment for a term which may extend to fourteen years, and with whipping, and shall also be liable to fine."
    },
    {
      "provision_ref": "s415",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "415",
      "title": "Cheating",
      "content": "415. Whoever, by deceiving any person, whether or not such deception was the sole or main inducement, fraudulently or dishonestly induces the person so deceived to deliver any property to any person, or to consent that any person shall retain any property, or intentionally induces the person so deceived to do or omit to do anything which he would not do or omit if he were not so deceived, and which act or omission causes or is likely to cause damage or harm to that person in body, mind, reputation, or property, is said to cheat."
    },
    {
      "provision_ref": "s416",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "416",
      "title": "Cheating by personation",
      "content": "416. A person is said to cheat by personation, if he cheats by pretending to be some other person, or by knowingly substituting one person for another, or representing that he or any other person is a person other than he or such other person really is."
    },
    {
      "provision_ref": "s417",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "417",
      "title": "Punishment for cheating",
      "content": "417. Whoever cheats shall be punished with imprisonment for a term which may extend to five years, or with fine, or with both."
    },
    {
      "provision_ref": "s418",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "418",
      "title": "Cheating with knowledge that wrongful loss may be caused",
      "content": "418. Whoever cheats with the knowledge that he is likely thereby to cause wrongful loss to a person whose interest in the transaction to which the cheating relates he was bound, either by law or by a legal contract, to protect, shall be punished with imprisonment for a term which may extend to seven years, and shall also be liable to fine."
    },
    {
      "provision_ref": "s420",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "420",
      "title": "Cheating and dishonestly inducing delivery of property",
      "content": "420. Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, or to make, alter, or destroy the whole or any part of a valuable security, or anything which is signed or sealed, and which is capable of being converted into a valuable security, shall be punished with imprisonment for a term which shall not be less than one year and not more than ten years, and with whipping, and shall also be liable to fine."
    },
    {
      "provision_ref": "s424",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "424",
      "title": "Dishonest or fraudulent removal or concealment of property",
      "content": "424. Whoever dishonestly or fraudulently conceals or removes any property of himself or any other person, or dishonestly or fraudulently assists in the concealment or removal thereof, or dishonestly releases any demand or claim to which he is entitled, shall be punished with imprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
      "provision_ref": "s425",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "425",
      "title": "Mischief",
      "content": "425. Whoever, with intent to cause, or knowing that he is likely to cause, wrongful loss or damage to the public or to any person, causes the destruction of any property, or any such change in any property, or in the situation thereof, as destroys or diminishes its value or utility, or affects it injuriously, commits mischief. Explanation 1. — It is not essential to the offence of mischief that the offender should intend to cause loss or damage to the owner of the property injured or destroyed. It is sufficient if he intends to cause, or knows that he is likely to cause, wrongful loss or damage to any person by injuring any property, whether it belongs to that person or not. Explanation 2. — Mischief may be committed by an act affecting property belonging to the person who commits the act, or to that person and others jointly."
    },
    {
      "provision_ref": "s426",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "426",
      "title": "Punishment for mischief",
      "content": "426. Whoever commits mischief shall be punished with imprisonment for a term which may extend to five years, or with fine, or with both."
    },
    {
      "provision_ref": "s427",
      "chapter": "CHAPTER XVII - OF OFFENCES AGAINST PROPERTY",
      "section": "427",
      "title": "Mischief causing damage of fifty ringgit or upwards",
      "content": "427. Whoever commits mischief and thereby causes loss or damage to the amount of fifty ringgit or upwards shall be punished with imprisonment for a term which may extend to five years, or with fine, or with both."
    },
    {
      "provision_ref": "s463",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "463",
      "title": "Forgery",
      "content": "463. Whoever makes any false document or false electronic record, or part of a document or electronic record, with intent to cause damage or injury to the public or to any person, or to support any claim or title, or to cause any person to part with property, or to enter into any express or implied contract, or with intent to commit fraud or that fraud may be committed, commits forgery."
    },
    {
      "provision_ref": "s464",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "464",
      "title": "Making a false document",
      "content": "464. (1) A person is said to make a false document or false electronic record — (a) who dishonestly or fraudulently makes, signs, seals or executes a document or part of a document, or makes or transmits any electronic record or part of any electronic record, with the intention of causing it to be believed that such document or part of a document or electronic record or part of electronic record was made, signed, sealed or executed by, or by the authority of, a person by whom or by whose authority he knows that it was not made, signed, sealed or executed; (b) who, without lawful authority, dishonestly or fraudulently, by cancellation or otherwise, alters a document or an electronic record in any material part thereof, after it has been made, executed or transmitted; (c) who dishonestly or fraudulently causes any person to sign, seal, execute or alter a document or an electronic record, or to transmit any electronic record, knowing that such person by reason of unsoundness of mind or intoxication cannot, or that by reason of deception practised upon him he does not, know the contents of the document or electronic record or the nature of the alteration."
    },
    {
      "provision_ref": "s465",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "465",
      "title": "Punishment for forgery",
      "content": "465. Whoever commits forgery shall be punished with imprisonment for a term which may extend to four years, or with fine, or with both."
    },
    {
      "provision_ref": "s467",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "467",
      "title": "Forgery of a valuable security, will, etc.",
      "content": "467. Whoever forges a document which purports to be a valuable security or a will, or an authority to adopt a son, or which purports to give authority to any person to make or transfer any valuable security, or to receive the principal, interest, or dividends thereon, or to receive or deliver any money, movable property, or valuable security, or any document purporting to be an acquittance or receipt acknowledging the payment of money, or an acquittance or receipt for the delivery of any movable property or valuable security, shall be punished with imprisonment for a term which may extend to twenty years, and shall also be liable to fine."
    },
    {
      "provision_ref": "s468",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "468",
      "title": "Forgery for purpose of cheating",
      "content": "468. Whoever commits forgery, intending that the document or electronic record forged shall be used for the purpose of cheating, shall be punished with imprisonment for a term which may extend to seven years, and shall also be liable to fine."
    },
    {
      "provision_ref": "s471",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "471",
      "title": "Using as genuine a forged document or electronic record",
      "content": "471. Whoever fraudulently or dishonestly uses as genuine any document or electronic record which he knows or has reason to believe to be a forged document or electronic record, shall be punished in the same manner as if he had forged such document or electronic record."
    },
    {
      "provision_ref": "s474",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "474",
      "title": "Having possession of document described in section 467, knowing it to be forged",
      "content": "474. Whoever has in his possession any document or electronic record, knowing the same to be forged, and intending that the same shall fraudulently or dishonestly be used as genuine, shall, if the document or electronic record is one of the description mentioned in section 467, be punished with imprisonment for a term which may extend to twenty years, and shall also be liable to fine."
    },
    {
      "provision_ref": "s477A",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "477A",
      "title": "Falsification of accounts",
      "content": "477A. Whoever, being a clerk, officer or servant, or employed or acting in the capacity of a clerk, officer or servant, wilfully and with intent to defraud, destroys, alters, mutilates or falsifies any book, electronic record, paper, writing, valuable security or account which belongs to or is in the possession of his employer, or has been received by him for or on behalf of his employer, or wilfully and with intent to defraud makes or abets the making of any false entry in, or omits or alters or abets the omission or alteration of any material particular from or in any such book, electronic record, paper, writing, valuable security or account, shall be punished with imprisonment for a term which may extend to seven years, or with fine, or with both."
    },
    {
      "provision_ref": "s499",
      "chapter": "CHAPTER XXI - OF DEFAMATION",
      "section": "499",
      "title": "Defamation",
      "content": "499. Whoever, by words either spoken or intended to be read, or by signs, or by visible representations, makes or publishes any imputation concerning any person, intending to harm, or knowing or having reason to believe that such imputation will harm, the reputation of such person, is said, except in the cases hereinafter excepted, to defame that person. Explanation 1. — It may amount to defamation to impute anything to a deceased person, if the imputation would harm the reputation of that person if living, and is intended to be hurtful to the feelings of his family or other near relatives. Explanation 2. — It may amount to defamation to make an imputation concerning a company or an association or collection of persons as such. Explanation 3. — An imputation in the form of an alternative or expressed ironically may amount to defamation. Explanation 4. — No imputation is said to harm a person's reputation unless that imputation, directly or indirectly, in the estimation of others, lowers the moral or intellectual character of that person, or lowers the character of that person in respect of his caste or of his calling, or lowers the credit of that person, or causes it to be believed that the body of that person is in a loathsome state, or in a state generally considered as disgraceful."
    },
    {
      "provision_ref": "s500",
      "chapter": "CHAPTER XXI - OF DEFAMATION",
      "section": "500",
      "title": "Punishment for defamation",
      "content": "500. Whoever defames another shall be punished with imprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
      "provision_ref": "s501",
      "chapter": "CHAPTER XXI - OF DEFAMATION",
      "section": "501",
      "title": "Printing or engraving matter known to be defamatory",
      "content": "501. Whoever prints or engraves any matter, knowing or having good reason to believe that such matter is defamatory of any person, shall be punished with imprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
      "provision_ref": "s502",
      "chapter": "CHAPTER XXI - OF DEFAMATION",
      "section": "502",
      "title": "Sale of printed or engraved substance containing defamatory matter",
      "content": "502. Whoever sells or offers for sale any printed or engraved substance, containing defamatory matter, knowing that it contains such matter, shall be punished with imprisonment for a term which may extend to two years, or with fine, or with both."
    },
    {
      "provision_ref": "s469",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "469",
      "title": "Forgery for purpose of harming reputation",
      "content": "469. Whoever commits forgery, intending that the document or electronic record forged shall harm the reputation of any party, or knowing that it is likely to be used for that purpose, shall be punished with imprisonment for a term which may extend to seven years, and shall also be liable to fine."
    },
    {
      "provision_ref": "s470",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "470",
      "title": "Forged document or electronic record",
      "content": "470. A false document or false electronic record made wholly or in part by forgery is designated 'a forged document' or 'a forged electronic record'."
    },
    {
      "provision_ref": "s472",
      "chapter": "CHAPTER XVIII - OF OFFENCES RELATING TO DOCUMENTS AND TO CURRENCY NOTES AND BANK NOTES",
      "section": "472",
      "title": "Making or possessing counterfeit seal, etc., with intent to commit forgery punishable under section 467",
      "content": "472. Whoever makes or counterfeits any seal, plate, or other instrument for making an impression, intending that the same shall be used for the purpose of committing any forgery which would be punishable under section 467 of this Code, or, with such intent, has in his possession any such seal, plate or other instrument, knowing the same to be counterfeit, shall be punished with imprisonment for a term which may extend to twenty years, and shall also be liable to fine."
    },
    {
      "provision_ref": "s503",
      "chapter": "CHAPTER XXII - OF CRIMINAL INTIMIDATION, INSULT AND ANNOYANCE",
      "section": "503",
      "title": "Criminal intimidation",
      "content": "503. Whoever threatens another with any injury to his person, reputation, or property, or to the person or reputation of any one in whom that person is interested, with intent to cause alarm to that person, or to cause that person to do any act which he is not legally bound to do, or to omit to do any act which that person is legally entitled to do, as the means of avoiding the execution of such threat, commits criminal intimidation."
    },
    {
      "provision_ref": "s506",
      "chapter": "CHAPTER XXII - OF CRIMINAL INTIMIDATION, INSULT AND ANNOYANCE",
      "section": "506",
      "title": "Punishment for criminal intimidation",
      "content": "506. Whoever commits the offence of criminal intimidation shall be punished with imprisonment for a term which may extend to two years, or with fine, or with both. If the threat is to cause death or grievous hurt, or to cause the destruction of any property by fire, or to cause an offence punishable with death or imprisonment for a term which may extend to seven years or more, or to impute unchastity to a woman, shall be punished with imprisonment for a term which may extend to seven years, or with fine, or with both."
    },
    {
      "provision_ref": "s507",
      "chapter": "CHAPTER XXII - OF CRIMINAL INTIMIDATION, INSULT AND ANNOYANCE",
      "section": "507",
      "title": "Criminal intimidation by anonymous communication",
      "content": "507. Whoever commits the offence of criminal intimidation by an anonymous communication, or having taken precaution to conceal the name or abode of the person from whom the threat comes, shall be punished with imprisonment for a term which may extend to two years, in addition to the punishment provided for by the last preceding section."
    }
  ],
  "definitions": [
    {
      "term": "dishonestly",
      "definition": "Whoever does anything with the intention of causing wrongful gain to one person, or wrongful loss to another person, is said to do that thing dishonestly.",
      "source_provision": "s24"
    },
    {
      "term": "fraudulently",
      "definition": "A person is said to do a thing fraudulently if he does that thing with intent to defraud, but not otherwise.",
      "source_provision": "s25"
    },
    {
      "term": "document",
      "definition": "Denotes any matter expressed or described upon any substance by means of letters, figures, or marks, or by more than one of those means, intended to be used, or which may be used, for the purpose of recording that matter, and includes electronic records.",
      "source_provision": "s29"
    },
    {
      "term": "valuable security",
      "definition": "Denotes a document which is, or purports to be, a document whereby any legal right is created, extended, transferred, restricted, extinguished, or released, or whereby any person acknowledges that he lies under legal liability, or has not a certain legal right.",
      "source_provision": "s30"
    },
    {
      "term": "wrongful gain",
      "definition": "Gain by unlawful means of property to which the person gaining is not legally entitled.",
      "source_provision": "s23"
    },
    {
      "term": "wrongful loss",
      "definition": "Loss by unlawful means of property to which the person losing it is legally entitled.",
      "source_provision": "s23"
    },
    {
      "term": "injury",
      "definition": "Any harm whatever illegally caused to any person, in body, mind, reputation or property.",
      "source_provision": "s44"
    }
  ]
}
